// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

console.log(friends.length >= 3 ? 'це великий масив, в якому  3 і більше елементи' : 'це маленький масив, в якому менше 3-х елементів');


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let a = 12;
// let b = 550;
// let c = 400;
//
// if (a > b && a < c || a > c && a < b) {
//     console.log(a);
// } else if (b > a && b < c || b > c && b < a) {
//     console.log(b);
// } else if (c > a && c < b || c > b && c < a) {
//     console.log(c);
// }


// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

let a = 4;
let b = 2;

let result = (a + b < 4) ? 'Мало' : 'Багато';
console.log(result);


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let any_number = -10;

let type_number = any_number === 0 ? 'нуль' : any_number < 0 ? "число негативне" : "число позитивне";
console.log(type_number);
